1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?

Ожиданий масса - начать и продолжить, но не заканчивать!

Вообще-то пошёл в GB изучать Python
Цели:
 - автоматизация рутины (продвинутые скрипты)
 - изучение "настоящего" ЯП, желательно с ООП
 - возможность создания своих проектов в основной работе
 
вот для проектов БД и нужны будут
так что ожидание - не только понять, "что это и с чем его едят", но и ввести "в постоянный рацион питания"

2) В какой сфере работаете сейчас?

Я системный администратор, уже 20 лет.
Windows, Linux, AD, сети, виртуализация (VMware и KVM)

3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?

Инструменты - FAR, bash, ssh 

язык программирования - FORTRAN, на первом курсе, потом наши пути с программированием разошлись.

писал скрипты в bash, и .bat/.cmd файлы, но так, небольшие...

в настоящее время, наверное, можно сказать, что немного ознакомился с Python и уже что-то в нём ... различаю? 
("понимаю" как-то боязно писать ))

с БД вплотную дела не имел, всё как-то "рядом", да и то в виде 1С

администрирование MS SQL Server, от 2000 и до 2016 (?? по моему этот...)
но со стороны "установить / добавить паролей-логинов / отдать SA 1С-никам" / сделать backup / добавить места

как-то так...

